/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////1
// В школе прошёл экзамен по математике. Некоторые ученики списали решения, были замечены и получили 0 баллов. Помогите учителю пересортировать оценки учеников.
// У вас есть массив оценок, и некоторые из них — 0. Ваша задача — переместить все оценки 0 в конец списка, сохранив при этом порядок остальных оценок.

// Первым параметром на вход программы подается размер массива. Вторым параметром – сам массив (значения указаны через пробел).
// На выходе ожидается строка из элементов массива (значения должны быть указаны через пробел).
// 	Пример 1
// Входные данные

// 6
// 0 0 6 0 9 8
// Выходные данные

// 6 9 8 0 0 0




// function sort(arr) {
// 	const result = [];

// 	arr.forEach(item => {
// 		item > 0 ? result.push(item) : null
// 	})

// 	while (result.length !== arr.length) {
// 		result.push(0)
// 	}
// 	return result
// }

// console.log(sort([6, 0, 0, 6, 0, 9, 8]))


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////2

var searchInsert = function(nums, target) {
    let left = 0;
    let right = nums.length - 1;

    while(left <= right) {
        let middle = Math.floor((left+right)/2)

        if(nums[middle] === target) {
            return middle;
        } 

        if(target > nums[middle]) {
            left = middle + 1
        } else if( target < nums[middle]) {
            right = middle - 1
        }
    }

	return left
};

console.log(searchInsert([1,3,5,6], 2))